
#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    int n;
    cin >> n;
    string f1[19] = { "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать" };
    string f2[8] = { "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    string f3[10] = { "", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот" };
    
    cout << f3[n / 100] << " ";
    if (n % 100 < 20 && n % 100 != 0)
    {
        cout << f1[n % 100 - 1];
        
    }
    else if (n % 100 > 19)
    {
        cout << f2[n / 10 % 10 - 2];
        if (n % 10 != 0)
        {
            cout << " " << f1[n % 10 - 1];
        }
    }
    return 0;
}